/*
This file is part of Telegram Desktop,
the official desktop version of Telegram messaging app, see https://telegram.org

Telegram Desktop is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

It is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
GNU General Public License for more details.

In addition, as a special exception, the copyright holders give permission
to link the code of portions of this program with the OpenSSL library.

Full license: https://github.com/telegramdesktop/tdesktop/blob/master/LICENSE
Copyright (c) 2014-2017 John Preston, https://desktop.telegram.org
*/
"lng_language_name" = "Українська";
"lng_switch_to_this" = "Переключитися на Українську";

"lng_menu_contacts" = "Контакти";
"lng_menu_calls" = "Викликів";
"lng_menu_settings" = "Налаштування";
"lng_menu_about" = "Про програму";
"lng_menu_update" = "Оновити";
"lng_menu_back" = "Назад";
"lng_menu_night_mode" = "Night mode";

"lng_disable_notifications_from_tray" = "Вимкнути сповіщення";
"lng_enable_notifications_from_tray" = "Увімкнути сповіщення";
"lng_open_from_tray" = "Відкрити Telegram";
"lng_minimize_to_tray" = "Згорнути у трей";
"lng_quit_from_tray" = "Вийти з Telegram\n";
"lng_tray_icon_text" = "Telegram досі запущено,\nВи можете змінити це у налаштуваннях.\nякщо цей значок зникне з області сповіщень, ви можете\nперетягти його сюди з набору прихованих значків.";

"lng_month1" = "Січень";
"lng_month2" = "Лютий";
"lng_month3" = "Березень";
"lng_month4" = "Квітень";
"lng_month5" = "Травень";
"lng_month6" = "Червень";
"lng_month7" = "Липень";
"lng_month8" = "Серпень";
"lng_month9" = "Вересень";
"lng_month10" = "Жовтень";
"lng_month11" = "Листопад";
"lng_month12" = "Грудень";

"lng_month1_small" = "січ";
"lng_month2_small" = "лют";
"lng_month3_small" = "бер";
"lng_month4_small" = "квіт";
"lng_month5_small" = "трав";
"lng_month6_small" = "черв";
"lng_month7_small" = "лип";
"lng_month8_small" = "серп";
"lng_month9_small" = "вер";
"lng_month10_small" = "жовт";
"lng_month11_small" = "лист";
"lng_month12_small" = "груд";

"lng_weekday1" = "Пн";
"lng_weekday2" = "Вт";
"lng_weekday3" = "Ср";
"lng_weekday4" = "Чт";
"lng_weekday5" = "Пт";
"lng_weekday6" = "Сб";
"lng_weekday7" = "Нд";

"lng_month_day" = "{day} {month}";
"lng_month_day_year" = "{day} {month} {year}";
"lng_month_year" = "{month} {year}";

"lng_box_ok" = "OK";

"lng_cancel" = "Відмінити";
"lng_continue" = "Продовжити";
"lng_close" = "Закрити";
"lng_connecting" = "Підключення...";
"lng_connecting_to_proxy" = "Connecting to proxy...";
"lng_connecting_settings" = "Settings";
"lng_reconnecting#one" = "Reconnect in {count} s...";
"lng_reconnecting#other" = "Reconnect in {count} s...";
"lng_reconnecting_try_now" = "Підключитися зараз";

"lng_status_service_notifications" = "Сервісні повідомлення";
"lng_status_support" = "підтримка";
"lng_status_bot" = "робот";
"lng_status_bot_reads_all" = "має доступ до повідомлень";
"lng_status_bot_not_reads_all" = "не має доступу до повідомлень";
"lng_status_offline" = "був(-ла) в мережі дуже давно";
"lng_status_recently" = "був(-ла) в мережі нещодавно";
"lng_status_last_week" = "був(-ла) в мережі у цьому тижні";
"lng_status_last_month" = "був(-ла) в мережі цього місяця";
"lng_status_lastseen_now" = "був(-ла) в мережі тільки що";
"lng_status_lastseen_minutes#one" = "last seen {count} minute ago";
"lng_status_lastseen_minutes#other" = "last seen {count} minutes ago";
"lng_status_lastseen_hours#one" = "last seen {count} hour ago";
"lng_status_lastseen_hours#other" = "last seen {count} hours ago";
"lng_status_lastseen_today" = "був(-ла) в мережі сьогодні в {time}";
"lng_status_lastseen_yesterday" = "був(-ла) в мережі учора в {time}";
"lng_status_lastseen_date" = "був(-ла) в мережі {date}";
"lng_status_lastseen_date_time" = "був(-ла) в мережі {date} в {time}";
"lng_status_online" = "в мережі";
"lng_status_connecting" = "підключення...";

"lng_chat_status_unaccessible" = "група недоступна";
"lng_chat_status_members#one" = "{count} member";
"lng_chat_status_members#other" = "{count} members";
"lng_chat_status_online#one" = "{count} online";
"lng_chat_status_online#other" = "{count} online";
"lng_chat_status_members_online" = "{members_count}, {online_count}";

"lng_channel_status" = "канал";
"lng_group_status" = "група";

"lng_channel_members_link#one" = "{count} member";
"lng_channel_members_link#other" = "{count} members";
"lng_channel_admins_link#one" = "{count} administrator";
"lng_channel_admins_link#other" = "{count} administrators";

"lng_server_error" = "Внутрішня помилка сервера.";
"lng_flood_error" = "Забагато спроб, будь ласка, пізніше спробуйте знову.";
"lng_gif_error" = "An error has occurred while reading GIF animation :(";
"lng_edit_error" = "Ви не можете редагувати це повідомлення";
"lng_join_channel_error" = "Даруйте, Ви вже є учасником завеликої кількості каналів та супергруп. Будь ласка залиште якусь групу або канал до приєднання.";
"lng_error_phone_flood" = "Sorry, you have deleted and re-created your account too many times recently. Please wait for a few days before signing up again.";
"lng_error_start_minimized_passcoded" = "You have set a local passcode, so the app can't be launched minimized. App will ask you to enter the passcode before it can start working.";
"lng_error_pinned_max#one" = "Sorry, you can pin no more than {count} chat to the top.";
"lng_error_pinned_max#other" = "Sorry, you can pin no more than {count} chats to the top.";
"lng_error_public_groups_denied" = "Unfortunately, you were banned from participating in public groups.\n{more_info}";
"lng_error_cant_add_member" = "Sorry, you can't add the bot to this group. Ask a group admin to do it.";
"lng_error_cant_add_bot" = "Sorry, this bot can't be added to groups.";
"lng_error_cant_add_admin_invite" = "Sorry, you can't add this user as an admin because they are not a member of this group and you are not allowed to invite them.";
"lng_error_cant_add_admin_unban" = "Sorry, you can't add this user as an admin because they are in the blacklist and you can't unban them.";
"lng_error_cant_ban_admin" = "Sorry, you can't ban this user because they are an admin in this group and you are not allowed to demote them.";
"lng_sure_add_admin_invite" = "This user is not a member of this group. Add them to the group and promote them to admin?";
"lng_sure_add_admin_unban" = "This user is currently restricted or banned in this group. Are you sure you want to unban and promote them?";
"lng_sure_ban_admin" = "This user is an admin in this group. Are you sure you want to go ahead and restrict them?";
"lng_sure_ban_user_group" = "Ban {user} in the group?";
"lng_sure_enable_socks" = "Are you sure you want to enable this proxy?\n\nServer: {server}\nPort: {port}\n\nYou can change your proxy server later in the Settings (Connection Type).";
"lng_sure_enable" = "Enable";

"lng_edit_deleted" = "Це повідомлення було видалено";
"lng_edit_too_long" = "Ваш текстове повідомлення задовге";
"lng_edit_message" = "Редагувати повідомлення";
"lng_edit_message_text" = "Нове текстове повідомлення...";
"lng_deleted" = "Видалений обліковий запис";
"lng_deleted_message" = "Видалене повідомлення";
"lng_pinned_message" = "Прикріплене повідомлення";
"lng_pinned_unpin_sure" = "Бажаєте відкріпити це повідомлення?";
"lng_pinned_pin_sure" = "Прикріпити це повідомлення?";
"lng_pinned_pin" = "Прикріпити";
"lng_pinned_unpin" = "Відкріпити";
"lng_pinned_notify" = "Сповістити всіх учасників";

"lng_intro_about" = "Welcome to the official Telegram Desktop app.\nIt's fast and secure.";
"lng_start_msgs" = "Почати спілкування";

"lng_intro_next" = "Далі";
"lng_intro_finish" = "Зареєструватися";
"lng_intro_submit" = "ВІДПРАВИТИ";

"lng_photo_caption" = "Заголовок";
"lng_photos_comment" = "Comment";

"lng_phone_title" = "Ваш телефон";
"lng_phone_desc" = "Будь ласка, підтвердьте ваш код країни та\nвведіть Ваш номер телефону.";
"lng_phone_notreg" = "If you don't have a Telegram account yet,\nplease [b]sign up[/b] with {link_start}Android / iPhone{link_end} or {signup_start}here{signup_end}";
"lng_country_code" = "Код країни";
"lng_bad_country_code" = "Недійсний код країни";
"lng_country_ph" = "Пошук";
"lng_country_none" = "Країна не знайдена";
"lng_country_select" = "Оберіть країну";

"lng_code_ph" = "Ваш код";
"lng_code_desc" = "Ми надіслали вам повідомлення з кодом активації на вказаний вами номер.\nБудь ласка, введіть його в це поле.";
"lng_code_telegram" = "Please enter the code you've just received\nin your previous [b]Telegram[/b] app.";
"lng_code_no_telegram" = "Надіслати код через SMS";
"lng_code_call" = "Telegram зателефонує вам через {minutes}:{seconds}";
"lng_code_calling" = "Запит дзвінка від Telegram..";
"lng_code_called" = "Telegram набирає номер";

"lng_bad_phone" = "Недійсний номер телефону. Будь ласка, спробуйте знову.";
"lng_bad_phone_noreg" = "Номер телефону не зареєстрований.";
"lng_bad_code" = "Ви ввели невірний код.";
"lng_bad_name" = "Будь ласка, введіть Ваше ім'я та прізвище.";
"lng_bad_photo" = "Вибране погане зображення.";

"lng_signin_title" = "Перевірка паролю хмарного сховища";
"lng_signin_desc" = "Будь ласка, введіть пароль хмарного сховища.";
"lng_signin_recover_desc" = "Please enter the code from the e-mail\n{email}";
"lng_signin_password" = "Ваш пароль хмарного сховища";
"lng_signin_code" = "Код, який ми відправили в e-mail";
"lng_signin_recover" = "Забули пароль?";
"lng_signin_recover_title" = "Скинути пароль";
"lng_signin_hint" = "Підказка: {password_hint}";
"lng_signin_recover_hint" = "Код був відправлений на {recover_email}";
"lng_signin_bad_password" = "Ви ввели неправильний пароль";
"lng_signin_wrong_code" = "Ви ввели недійсний код.";
"lng_signin_try_password" = "Складнощі з доступом до ел. пошти?";
"lng_signin_password_removed" = "Ваш хмарний пароль було деактивовано.\nВи можете встановити новий в Налаштуваннях.";
"lng_signin_no_email_forgot" = "Оскільки ви, при створенні пароля, не вказали адресу електронної пошти для відновлення, то вам залишилось, або запам'ятати ваш пароль, або скинути налаштування вашої обліковки.";
"lng_signin_cant_email_forgot" = "Якщо ви не в змозі відновити доступ до ел. скриньки, то вам залишилось, або запам'ятати ваш пароль, або скинути налаштування вашої обліковки.";
"lng_signin_reset_account" = "Скинути налаштування обліковки";
"lng_signin_sure_reset" = "Warning!\n\nYou will lose all your chats and messages, along with any media and files you shared!\n\nDo you want to reset your account?";
"lng_signin_reset" = "Скинути";
"lng_signin_reset_wait" = "Since the account {phone_number} is active and protected by a password, we will delete it in 1 week for security purposes. You can cancel this process at any time.\n\nYou’ll be able to reset your account in:\n{when}";
"lng_signin_reset_days#one" = "{count} day";
"lng_signin_reset_days#other" = "{count} days";
"lng_signin_reset_hours#one" = "{count} hour";
"lng_signin_reset_hours#other" = "{count} hours";
"lng_signin_reset_minutes#one" = "{count} minute";
"lng_signin_reset_minutes#other" = "{count} minutes";
"lng_signin_reset_in_days" = "{days_count} {hours_count} {minutes_count}";
"lng_signin_reset_in_hours" = "{hours_count} {minutes_count}";
"lng_signin_reset_cancelled" = "Your recent attempts to reset this account have been cancelled by its active user. Please try again in 7 days.";

"lng_signup_title" = "Інформація про вас";
"lng_signup_desc" = "Будь ласка, введіть ваше ім'я та\nзавантажте фотографію.";

"lng_signup_firstname" = "Ім'я";
"lng_signup_lastname" = "Прізвище";

"lng_dlg_filter" = "Пошук";
"lng_dlg_new_group_name" = "Назва групи";
"lng_dlg_new_channel_name" = "Назва каналу";
"lng_no_contacts" = "У вас немає контактів";
"lng_no_chats" = "Ваші балачки будуть тут";
"lng_contacts_loading" = "Завантаження...";
"lng_contacts_not_found" = "Контакти не знайдені";
"lng_dlg_search_for_messages" = "Шукати повідомлення";
"lng_update_telegram" = "Update Telegram";
"lng_dlg_search_in" = "Search messages in";
"lng_dlg_search_from" = "From: {user}";

"lng_settings_save" = "Зберегти";
"lng_settings_upload" = "Оновити фото";
"lng_settings_crop_profile" = "Select an area for your profile photo";
"lng_settings_uploading_photo" = "Вивантадити світлину...";
"lng_settings_edit" = "Редагувати";
"lng_settings_drop_area_subtitle" = "to set it as your photo";

"lng_username_title" = "Ім'я користувача";
"lng_username_about" = "Ви можете вибрати ім'я користувача Telegram.\nЯкщо Ви це зробите, інші люди зможуть знайти\nВас по цьому імені користувача і зв'язатись з Вами,\nне знаючи Вашого номера телефону..\n\nВи можете використовувати A-Z, 0-9 і символ підкреслення.\nМінімальна довжина становить 5 символів.";
"lng_username_choose" = "Обрати собі ім'я користувача.";
"lng_username_invalid" = "Це ім'я користувача некоректне.";
"lng_username_occupied" = "Це ім'я вже зайняте.";
"lng_username_too_short" = "Це ім'я закоротке.";
"lng_username_bad_symbols" = "Ім'я користувача містить недопустимі символи.";
"lng_username_available" = "Це ім'я доступне.";
"lng_username_not_found" = "Користувач @{user} не знайдений.";
"lng_username_link_willbe" = "Така ланка відкриєрозмову з Вами:";
"lng_username_link" = "Ця ланка відкриває розмову з Вами:";
"lng_username_copied" = "Ланку скопійовано до буферу обміну";

"lng_bio_title" = "Edit your bio";
"lng_bio_placeholder" = "Bio";
"lng_bio_about" = "You can add a few lines about yourself. Anyone who opens your profile will see this text.";

"lng_settings_section_info" = "Інформація";
"lng_settings_username" = "Ім'я користувача:";
"lng_settings_choose_username" = "Оберіть ім'я користувача";
"lng_settings_empty_bio" = "None";

"lng_settings_section_notify" = "Сповіщення";
"lng_settings_desktop_notify" = "Сповіщення на робочому столі";
"lng_settings_show_name" = "Показати ім'я відправника";
"lng_settings_show_preview" = "Відображувати прев'ю повідомлення";
"lng_settings_use_windows" = "Використовувати сповіщення Windows";
"lng_settings_use_native_notifications" = "Use native notifications";
"lng_settings_advanced_notifications" = "Notifications position and count";
"lng_settings_notifications_position" = "Location on the screen";
"lng_settings_notifications_count" = "Notifications count";
"lng_settings_sound_notify" = "Звук";
"lng_settings_include_muted" = "Include muted chats in unread count";

"lng_notification_preview" = "У вас нове повідомлення";
"lng_notification_reply" = "Reply";
"lng_notification_hide_all" = "Hide all";
"lng_notification_sample" = "This is a sample notification";

"lng_settings_section_general" = "Загальне";
"lng_settings_change_lang" = "Змінити мову";
"lng_languages" = "Мови";
"lng_sure_save_language" = "Щоб змінити мову Telegram буде перезапущено";
"lng_settings_update_automatically" = "Оновлювати автоматично";
"lng_settings_current_version_label" = "Версія {version}";
"lng_settings_current_version" = "Версія {version}";
"lng_settings_check_now" = "Перевірка оновлень";
"lng_settings_update_checking" = "Перевіряються оновлення...";
"lng_settings_latest_installed" = "Встановлена остання версія!";
"lng_settings_downloading" = "Стягнення оновлення  {готове} / {загалом} MБ...";
"lng_settings_update_ready" = "Оновлення завантажене";
"lng_settings_update_now" = "Перезавантажити зараз";
"lng_settings_update_fail" = "Перевірка оновлення не вдалась :(";
"lng_settings_workmode_tray" = "Відображувати іконку в треї";
"lng_settings_workmode_window" = "Відображувати іконку в панелі завдань";
"lng_settings_auto_start" = "Запускати Telegram при старті системи";
"lng_settings_start_min" = "Запускати у згорнутому вигляді";
"lng_settings_add_sendto" = "Добавити Telegram в меню «Надіслати...»";
"lng_settings_section_scale" = "Interface Scale";
"lng_settings_scale_auto" = "Авто ({cur})";

"lng_settings_section_chat_settings" = "Chat Settings";
"lng_settings_replace_emojis" = "Поміняти емодзі?";
"lng_settings_view_emojis" = "Проглянути список";
"lng_settings_send_enter" = "Відсилати по Enter";
"lng_settings_send_ctrlenter" = "Відсилати по Ctrl+Enter";
"lng_settings_send_cmdenter" = "Відсилати по Cmd+Enter";

"lng_settings_section_background" = "Фонове зображення чату";
"lng_settings_bg_use_default" = "Use default color theme";
"lng_settings_bg_from_gallery" = "Вибрати з галереї";
"lng_settings_bg_from_file" = "Вибрати з файлу";
"lng_settings_bg_edit_theme" = "Редагувати тему";
"lng_settings_bg_tile" = "Замостити";
"lng_settings_adaptive_wide" = "Adaptive layout for wide screens";

"lng_backgrounds_header" = "Оберіть новий фон для чату";
"lng_theme_sure_keep" = "Keep this color theme?";
"lng_theme_reverting#one" = "Reverting to the old color theme in {count} second.";
"lng_theme_reverting#other" = "Reverting to the old color theme in {count} seconds.";
"lng_theme_keep_changes" = "Keep changes";
"lng_theme_revert" = "Revert";

"lng_download_path_dont_ask" = "Не питати шлях для збереження";
"lng_download_path_label" = "Шлях для збереження:";
"lng_download_path_temp" = "тимчасова тека";
"lng_download_path_default" = "тека за замовчуванням";
"lng_download_path_clear" = "Очистити все";
"lng_download_path_header" = "Оберіть шлях для завантаження";
"lng_download_path_default_radio" = "Тека «Завантаження»";
"lng_download_path_temp_radio" = "Тимчасова тека, буде очищена при виході або видаленні додатка";
"lng_download_path_dir_radio" = "Тека користувача, очищається вручну!";
"lng_download_path_choose" = "Оберіть шлях для завантаження";
"lng_sure_clear_downloads" = "Видалити всі завантажені файли з тимчасової теки? Це робиться автоматично при виході або видалення програми.";
"lng_download_path_failed" = "Неможливо запустити завантажений файл. Це могло статися через неможливість зберегти файл в теці, котра призначена за замовчуванням.\n\nВи можете змінити шлях до цієї теки в Налаштуваннях.";
"lng_download_path_settings" = "Налаштування";
"lng_download_finish_failed" = "Відбулась помилка при завантаженні файлу.\n\nХочете спробувати ще?";
"lng_download_path_clearing" = "Очищення...";
"lng_download_path_cleared" = "Очищено!";
"lng_download_path_clear_failed" = "Помилка очищення :(";

"lng_settings_section_privacy" = "Privacy and Security";

"lng_local_storage_title" = "Local storage";
"lng_settings_no_data_cached" = "Не знайдено кешованих даних!";
"lng_settings_images_cached#one" = "{count} image, {size}";
"lng_settings_images_cached#other" = "{count} images, {size}";
"lng_settings_audios_cached#one" = "{count} voice message, {size}";
"lng_settings_audios_cached#other" = "{count} voice messages, {size}";
"lng_local_storage_clear" = "Очистити кеш ";
"lng_local_storage_clearing" = "Очищення...";
"lng_local_storage_cleared" = "Очищено!";
"lng_local_storage_clear_failed" = "Не вдалося очистити кеш :(";

"lng_settings_section_advanced_settings" = "Розширенні налаштування";
"lng_settings_enable_night_theme" = "Enable night mode";
"lng_settings_disable_night_theme" = "Disable night mode";

"lng_passcode_remove_button" = "Вилучити";

"lng_passcode_turn_on" = "Увімкнути локальний код доступу";
"lng_passcode_change" = "Змінити локальний код доступу";
"lng_passcode_create" = "Локальний код доступу";
"lng_passcode_remove" = "Видалити локальний код доступу";
"lng_passcode_turn_off" = "Виключити блокування паролем";
"lng_passcode_autolock" = "Автоблокування";
"lng_passcode_autolock_away" = "Блокувати при відсутності протягом:";
"lng_passcode_autolock_inactive" = "Блокувати при відсутності активності протягом:";
"lng_passcode_autolock_minutes#one" = "{count} minute";
"lng_passcode_autolock_minutes#other" = "{count} minutes";
"lng_passcode_autolock_hours#one" = "{count} hour";
"lng_passcode_autolock_hours#other" = "{count} hours";
"lng_passcode_enter_old" = "Введіть поточний код доступу";
"lng_passcode_enter_first" = "Введіть код доступу.";
"lng_passcode_enter_new" = "Введіть новий код доступу";
"lng_passcode_confirm_new" = "Повторіть введення паролю";
"lng_passcode_about" = "When a local passcode is set, a lock icon appears at the top of your chats list. Click it to lock the app.\n\nNote: if you forget your local passcode, you'll need to relogin in Telegram Desktop.";
"lng_passcode_differ" = "Паролі не збігаються";
"lng_passcode_wrong" = "Неправильний код доступу";
"lng_passcode_is_same" = "Код доступу не було змінено";
"lng_passcode_enter" = "Введіть ваш локальний код доступу";
"lng_passcode_ph" = "Your passcode";
"lng_passcode_submit" = "Розблокувати";
"lng_passcode_logout" = "Вийти з аккаунту";
"lng_passcode_need_unblock" = "You need to unlock me first.";

"lng_cloud_password_waiting" = "Ланка підтвердження надіслана до {email}...";
"lng_cloud_password_change" = "Змінити хмарний пароль";
"lng_cloud_password_create" = "Хмарний пароль";
"lng_cloud_password_remove" = "Видалити хмарний пароль";
"lng_cloud_password_set" = "Увімкнути двофакторну перевірку";
"lng_cloud_password_edit" = "Змінити хмарний пароль";
"lng_cloud_password_enter_old" = "Введіть поточний пароль";
"lng_cloud_password_enter_first" = "Введіть пароль";
"lng_cloud_password_enter_new" = "Введіть новий пароль";
"lng_cloud_password_confirm_new" = "Повторно введіть новий пароль";
"lng_cloud_password_hint" = "Введіть натяк на пароль";
"lng_cloud_password_change_hint" = "Введіть нову підказку для пароля";
"lng_cloud_password_bad" = "Пароль та натяк на нього не можуть бути однаковими.";
"lng_cloud_password_email" = "Введіть ел. скриньку для відновлення";
"lng_cloud_password_bad_email" = "Неправильна електронна скринька, спробуйте іншу.";
"lng_cloud_password_about" = "This password will be asked when you log in on a new device in addition to the pin code.";
"lng_cloud_password_about_recover" = "Попередження! Чи ви впевнені що не хочете\nдодати ел. скриньку для відновлення паролю?\n\nЯкщо ви забудете пароль, то втратите доступ до своєї обліковки Telegram.";
"lng_cloud_password_skip_email" = "Пропустити електронну пошту";
"lng_cloud_password_almost" = "A confirmation link was sent to the\ne-mail you provided. Two-step verification will be enabled as soon as you follow that link.";
"lng_cloud_password_was_set" = "Двофакторну перевірку увімкнено.";
"lng_cloud_password_updated" = "Ваш хмарний пароль було оновлено.";
"lng_cloud_password_removed" = "Двофакторну перевірку вимкнено.";
"lng_cloud_password_differ" = "Паролі не збігаються";
"lng_cloud_password_wrong" = "Неправильний хмарний пароль";
"lng_cloud_password_is_same" = "Пароль не було змінено";

"lng_connection_type" = "Тип з'єднання:";
"lng_connection_auto_connecting" = "Default (connecting...)";
"lng_connection_auto" = "Усталений ({transport} used)";
"lng_connection_proxy_connecting" = "Connecting through proxy...";
"lng_connection_proxy" = "{transport} з проксі";
"lng_connection_header" = "Тип з'єднання";
"lng_connection_auto_rb" = "Автоматично (TCP якщо доступно, або HTTP)";
"lng_connection_http_proxy_rb" = "HTTP з нестандартним http-проксі";
"lng_connection_tcp_proxy_rb" = "TCP з нестандартним socks5-проксі";
"lng_connection_try_ipv6" = "Спробувати з'єднання через IPv6";
"lng_connection_host_ph" = "Хост";
"lng_connection_port_ph" = "Порт";
"lng_connection_user_ph" = "Логін";
"lng_connection_password_ph" = "Пароль";
"lng_connection_save" = "Зберегти";

"lng_settings_blocked_users" = "Заблоковані користувачі";
"lng_settings_last_seen_privacy" = "Last seen privacy";
"lng_settings_calls_privacy" = "Phone calls privacy";
"lng_settings_groups_invite_privacy" = "Group invite settings";
"lng_settings_show_sessions" = "Показати всі сеанси";
"lng_settings_self_destruct" = "Account self-destruct settings";
"lng_settings_change_phone" = "Change phone number";

"lng_settings_reset" = "Завершити всі інші сеанси";
"lng_settings_reset_sure" = "Впевнені, що хочете завершити всі інші сеанси?";
"lng_settings_reset_one_sure" = "Чи ви хочете завершити цей сеанс?";
"lng_settings_reset_button" = "Завершити";
"lng_settings_reset_done" = "Усі сесії завершені";
"lng_settings_manage_local_storage" = "Manage local storage";
"lng_settings_ask_question" = "Задати питання";
"lng_settings_ask_sure" = "Please note that Telegram Support is done by volunteers. We try to respond as quickly as possible, but it may take a while.\n\nPlease take a look at the Telegram FAQ: it has important troubleshooting tips and answers to most questions.";
"lng_settings_faq_button" = "Go to FAQ";
"lng_settings_ask_ok" = "Запитати";
"lng_settings_faq" = "Telegram FAQ";
"lng_settings_logout" = "Вийти";
"lng_sure_logout" = "Ви дійсно хочете вийти?";

"lng_settings_need_restart" = "You need to restart for applying some of the new settings. Restart now?";
"lng_settings_restart_now" = "ПЕРЕЗАПУСК";

"lng_sessions_header" = "Поточний сеанс";
"lng_sessions_other_header" = "Активний сеанс";
"lng_sessions_no_other" = "Інших сеансів немає";
"lng_sessions_other_desc" = "Ви можете увійти в Telegram з іншого мобільного телефона, планшета і настільних пристроїв, використовуючи такий самий номер телефону. Всі ваші дані будуть одразу ж синхронізовані.";
"lng_sessions_terminate_all" = "Завершити всі інші сеанси";

"lng_blocked_list_title" = "Blocked users";
"lng_blocked_list_unknown_phone" = "unknown phone";
"lng_blocked_list_unblock" = "Розблокувати";
"lng_blocked_list_add" = "Block user";
"lng_blocked_list_add_title" = "Select user to block";
"lng_blocked_list_already_blocked" = "blocked already";
"lng_blocked_list_about" = "Blocked users can't send you messages or add you to groups. They will not see your profile pictures, online and last seen status.";
"lng_blocked_list_not_found" = "No users found.";

"lng_edit_privacy_everyone" = "Everybody";
"lng_edit_privacy_contacts" = "Мої контакти";
"lng_edit_privacy_nobody" = "Nobody";
"lng_edit_privacy_exceptions" = "Add exceptions";

"lng_edit_privacy_lastseen_title" = "Last seen privacy";
"lng_edit_privacy_lastseen_description" = "You can choose who can see your last seen time:";
"lng_edit_privacy_lastseen_warning" = "Important: you won't be able to see Last Seen times for people with whom you don't share your Last Seen time. Approximate last seen will be shown instead (recently, within a week, within a month).";
"lng_edit_privacy_lastseen_always_empty" = "Always share with";
"lng_edit_privacy_lastseen_always#one" = "Always share with {count} user";
"lng_edit_privacy_lastseen_always#other" = "Always share with {count} users";
"lng_edit_privacy_lastseen_never_empty" = "Never share with";
"lng_edit_privacy_lastseen_never#one" = "Never share with {count} user";
"lng_edit_privacy_lastseen_never#other" = "Never share with {count} users";
"lng_edit_privacy_lastseen_exceptions" = "These settings will override the values above.";
"lng_edit_privacy_lastseen_always_title" = "Always share with";
"lng_edit_privacy_lastseen_never_title" = "Never share with";

"lng_edit_privacy_groups_title" = "Group invite settings";
"lng_edit_privacy_groups_description" = "You can choose who can add you to groups and channels with granular precision:";
"lng_edit_privacy_groups_always_empty" = "Always allow";
"lng_edit_privacy_groups_always#one" = "Always allow {count} user";
"lng_edit_privacy_groups_always#other" = "Always allow {count} users";
"lng_edit_privacy_groups_never_empty" = "Never allow";
"lng_edit_privacy_groups_never#one" = "Never allow {count} user";
"lng_edit_privacy_groups_never#other" = "Never allow {count} users";
"lng_edit_privacy_groups_exceptions" = "These users will or will not be able to add you to groups and channels regardless of the settings above.";
"lng_edit_privacy_groups_always_title" = "Завжди дозволяти";
"lng_edit_privacy_groups_never_title" = "Ніколи не дозволяти";

"lng_edit_privacy_calls_title" = "Phone calls privacy";
"lng_edit_privacy_calls_description" = "You can restrict who can call you:";
"lng_edit_privacy_calls_always_empty" = "Always allow";
"lng_edit_privacy_calls_always#one" = "Always allow {count} user";
"lng_edit_privacy_calls_always#other" = "Always allow {count} users";
"lng_edit_privacy_calls_never_empty" = "Never allow";
"lng_edit_privacy_calls_never#one" = "Never allow {count} user";
"lng_edit_privacy_calls_never#other" = "Never allow {count} users";
"lng_edit_privacy_calls_exceptions" = "These users will or will not be able to call you regardless of the settings above.";
"lng_edit_privacy_calls_always_title" = "Завжди дозволяти";
"lng_edit_privacy_calls_never_title" = "Ніколи не дозволяти";

"lng_self_destruct_title" = "Account self-destruction";
"lng_self_destruct_description" = "If you don't come online at least once within this period, your account will be deleted along with all groups, messages and contacts.";
"lng_self_destruct_months#one" = "{count} month";
"lng_self_destruct_months#other" = "{count} months";
"lng_self_destruct_years#one" = "{count} year";
"lng_self_destruct_years#other" = "{count} years";

"lng_change_phone_title" = "Змінити номер телефону";
"lng_change_phone_description" = "You can change your Telegram number\nhere. Your account and all your cloud data\n— messages, media, contacts, etc. will be\nmoved to the new number.\n\n[b]Important[/b]: all your Telegram contacts will\nget your [b]new number[/b] added to their address\nbook, provided they had your old number and\nyou haven't blocked them in Telegram.";
"lng_change_phone_warning" = "All your Telegram contacts will get your new number added to their address book, provided they had your old number and you haven't blocked them in Telegram.";
"lng_change_phone_occupied" = "The number {phone} is already connected to a Telegram account. Please delete that account before migrating to the new number.";
"lng_change_phone_button" = "Змінити номер";
"lng_change_phone_new_title" = "Введіть новий номер";
"lng_change_phone_new_description" = "We will send an SMS with a confirmation code to your new number.";
"lng_change_phone_new_submit" = "Submit";
"lng_change_phone_code_title" = "Введіть код";
"lng_change_phone_code_description" = "We've sent an SMS with a confirmation code to your phone {phone}.";
"lng_change_phone_success" = "Your phone number has been changed.";

"lng_mute_duration_hours#one" = "For {count} hour";
"lng_mute_duration_hours#other" = "For {count} hours";
"lng_mute_box_tip" = "Choose duration of turning off notifications from the following chat";

"lng_preview_loading" = "Getting Link Info...";

"lng_profile_settings_section" = "Налаштування";
"lng_profile_actions_section" = "Дії";
"lng_profile_bot_settings" = "Налаштування";
"lng_profile_bot_help" = "Допомога";
"lng_profile_invite_link_section" = "Invite link";
"lng_profile_create_public_link" = "Create public link";
"lng_profile_edit_public_link" = "Редагувати публічну ланку";
"lng_profile_search_members" = "Search members";
"lng_profile_manage_admins" = "Manage administrators";
"lng_profile_manage_blocklist" = "Manage banned users";
"lng_profile_manage_restrictedlist" = "Manage restricted users";
"lng_profile_recent_actions" = "Recent actions";
"lng_profile_common_groups#one" = "{count} group in common";
"lng_profile_common_groups#other" = "{count} groups in common";
"lng_profile_common_groups_section" = "Groups in common";
"lng_profile_participants_section" = "Учасники";
"lng_profile_info_section" = "Інформація";
"lng_profile_mobile_number" = "Mobile:";
"lng_profile_username" = "Ім'я користувача:";
"lng_profile_link" = "Посилання:";
"lng_profile_bio" = "Bio:";
"lng_profile_add_contact" = "Додати контакт";
"lng_profile_edit_contact" = "Редагувати";
"lng_profile_enable_notifications" = "Повідомлення";
"lng_profile_clear_history" = "Очистити історію";
"lng_profile_delete_conversation" = "Стерти розмову";
"lng_profile_clear_and_exit" = "Видалити й вийти";
"lng_profile_leave_channel" = "Покинути канал";
"lng_profile_delete_channel" = "Видалити канал";
"lng_profile_leave_group" = "Покинути групу";
"lng_profile_delete_group" = "Видалити групу";
"lng_profile_report" = "Report";
"lng_profile_search_messages" = "Шукати повідомлення";
"lng_profile_block_user" = "Заблокувати користувача";
"lng_profile_unblock_user" = "Розблокувати користувача";
"lng_profile_block_bot" = "Stop and block bot";
"lng_profile_unblock_bot" = "Unblock bot";
"lng_profile_send_message" = "Написати";
"lng_profile_share_contact" = "Надіслати контакт";
"lng_profile_invite_to_group" = "Додати до групи";
"lng_profile_delete_contact" = "Видалити";
"lng_profile_set_group_photo" = "Встановити фото";
"lng_profile_add_participant" = "Додати учасників";
"lng_profile_view_channel" = "View Channel";
"lng_profile_join_channel" = "Приєднатися";
"lng_profile_delete_and_exit" = "Покинути";
"lng_profile_kick" = "Вилучити";
"lng_profile_sure_kick" = "Видалити {user} з групи?";
"lng_profile_sure_kick_channel" = "Видалити {user} з каналу?";
"lng_profile_loading" = "Завантаження...";
"lng_profile_shared_media" = "Спільні файли";
"lng_profile_photos#one" = "{count} photo";
"lng_profile_photos#other" = "{count} photos";
"lng_profile_photos_header" = "Фотографії";
"lng_profile_videos#one" = "{count} video";
"lng_profile_videos#other" = "{count} videos";
"lng_profile_videos_header" = "Відео";
"lng_profile_songs#one" = "{count} audio file";
"lng_profile_songs#other" = "{count} audio files";
"lng_profile_songs_header" = "Аудіо файли";
"lng_profile_files#one" = "{count} file";
"lng_profile_files#other" = "{count} files";
"lng_profile_files_header" = "Файли";
"lng_profile_audios#one" = "{count} voice message";
"lng_profile_audios#other" = "{count} voice messages";
"lng_profile_audios_header" = "Голосові повідомлення";
"lng_profile_shared_links#one" = "{count} shared link";
"lng_profile_shared_links#other" = "{count} shared links";
"lng_profile_shared_links_header" = "Shared links";
"lng_profile_copy_phone" = "Копіювати номер телефону";
"lng_profile_copy_fullname" = "Копіювати ім'я";
"lng_profile_drop_area_title" = "Drop your image here";
"lng_profile_drop_area_subtitle" = "to set it as a group photo";
"lng_profile_drop_area_subtitle_channel" = "to set it as a channel photo";
"lng_profile_top_bar_share_contact" = "Share";

"lng_report_title" = "Report channel";
"lng_report_group_title" = "Report group";
"lng_report_bot_title" = "Report bot";
"lng_report_reason_spam" = "Спам";
"lng_report_reason_violence" = "Violence";
"lng_report_reason_pornography" = "Порнографія";
"lng_report_reason_other" = "Інше";
"lng_report_reason_description" = "Опис";
"lng_report_button" = "Звіт";
"lng_report_thanks" = "Thank you! Your report will be reviewed by our team very soon.";

"lng_channel_add_members" = "Додати учасників";
"lng_channel_add_banned" = "Ban user";
"lng_channel_add_restricted" = "Restrict user";
"lng_channel_admins" = "Адміністратори";
"lng_channel_add_admin" = "Додати адміністратора";
"lng_channel_admin_status_creator" = "Creator";
"lng_channel_admin_status_promoted_by" = "Promoted by {user}";
"lng_channel_admin_status_not_admin" = "Not administrator";
"lng_channel_banned_status_restricted_by" = "Restricted by {user}";

"lng_group_blocked_list_about" = "Banned users are removed from the group and can only come back if invited by an admin.\nInvite links don't work for them.";

"lng_chat_all_members_admins" = "Всі учасники є адміністраторами";
"lng_chat_about_all_admins" = "Group members can add new members, edit name and photo of the group.";
"lng_chat_about_admins" = "Group admins can add and remove members, edit name and photo of the group.";

"lng_participant_filter" = "Пошук";
"lng_participant_invite" = "Запросити";
"lng_participant_invite_sorry#one" = "Sorry, you can only add the first {count} member to a channel personally.\n\nFrom now on, people will need to join via your invite link.";
"lng_participant_invite_sorry#other" = "Sorry, you can only add the first {count} members to a channel personally.\n\nFrom now on, people will need to join via your invite link.";
"lng_create_group_back" = "Назад";
"lng_create_group_next" = "Далі";
"lng_create_group_create" = "Створити";
"lng_create_group_title" = "Нова група";
"lng_create_channel_title" = "Новий канал";
"lng_create_public_channel_title" = "Публічний канал";
"lng_create_public_channel_about" = "Anyone can find the channel in search and join";
"lng_create_private_channel_title" = "Приватний канал";
"lng_create_private_channel_about" = "Only people with a special invite link may join";
"lng_create_public_group_title" = "Публічна група";
"lng_create_public_group_about" = "Anyone can find the group in search and join, chat history is available to everybody";
"lng_create_private_group_title" = "Приватна група";
"lng_create_private_group_about" = "People can only join if they were invited or have an invite link";
"lng_create_group_skip" = "Пропустити";

"lng_create_channel_link_invalid" = "Це посилання не є дійсним";
"lng_create_channel_link_occupied" = "Sorry, this link is already occupied";
"lng_create_channel_link_too_short" = "Sorry, this link is too short";
"lng_create_channel_link_bad_symbols" = "Sorry, this link has bad symbols";
"lng_create_channel_link_available" = "Це посилання є доступним";
"lng_create_channel_link_copied" = "Посилання скопійовано в буфер";

"lng_create_group_crop" = "Select an area for group photo";
"lng_create_channel_crop" = "Select an area for channel photo";

"lng_failed_add_participant" = "Could not add user. Please try again later.";
"lng_failed_add_not_mutual" = "Sorry, if a person leaves a group, only a mutual contact can bring them back (they need to have your phone number, and you need theirs).";
"lng_failed_add_not_mutual_channel" = "Sorry, if a person leaves a channel, only a mutual contact can bring them back (they need to have your phone number, and you need theirs).";

"lng_sure_delete_contact" = "Видалити {contact} з вашого списку контактів?";
"lng_sure_delete_history" = "Видалити історію повідомлень з {contact}?\n\nЦю дію неможливо буде відмінити.";
"lng_sure_delete_group_history" = "Стерти всю історію повідомлень в «{group}»?\n\nЦю дію буде неможливо відмінити.";
"lng_sure_delete_and_exit" = "Видалити всю історію повідомлень та покинути «{group}»?\n\nЦю дію неможливо буде відмінити.";
"lng_sure_leave_channel" = "Are you sure, you want to leave\nthis channel?";
"lng_sure_delete_channel" = "Are you sure, you want to delete this channel? All members will be removed and all messages will be lost.";
"lng_sure_leave_group" = "Are you sure, you want to leave\nthis group? This action cannot be undone.";
"lng_sure_delete_group" = "Are you sure, you want to delete this group? All members will be removed and all messages will be lost.";

"lng_message_empty" = "Порожнє повідомлення";
"lng_message_unsupported" = "This message is not supported by your version of Telegram Desktop. Please update to the last version in Settings or install it from {link}";

"lng_duration_seconds#one" = "{count} second";
"lng_duration_seconds#other" = "{count} seconds";
"lng_duration_minsec_minutes#one" = "{count} min";
"lng_duration_minsec_minutes#other" = "{count} min";
"lng_duration_minsec_seconds#one" = "{count} sec";
"lng_duration_minsec_seconds#other" = "{count} sec";
"lng_duration_minutes_seconds" = "{minutes_count} {seconds_count}";

"lng_action_add_user" = "{from} додав(-ла) {user}";
"lng_action_add_users_many" = "{from} додав(-ла) {user}";
"lng_action_add_users_and_one" = "{accumulated}, {user}";
"lng_action_add_users_and_last" = "{accumulated} and {user}";
"lng_action_add_you" = "{from} added you to this channel";
"lng_action_you_joined" = "Ви приєдналися до цього каналу";
"lng_action_add_you_group" = "{from} added you to this group";
"lng_action_you_joined_group" = "Ви приєдналися до цієї групи";
"lng_action_kick_user" = "{from} видалив(-ла) {user}";
"lng_action_user_left" = "{from} покинув(-ла) групу";
"lng_action_user_joined" = "користувач {from} приєднався(-лася) до групи";
"lng_action_user_joined_by_link" = "користувач {from} приєднався до групи послуговуючись ланкою на запрошення";
"lng_action_user_registered" = "{from} приєднався(-лася) до Telegram";
"lng_action_removed_photo" = "{from} видалив(-ла) фото групи";
"lng_action_removed_photo_channel" = "Фото каналу вилучено";
"lng_action_changed_photo" = "{from} updated group photo";
"lng_action_changed_photo_channel" = "Фотографію каналу оновлено";
"lng_action_changed_title" = "{from} змінив(-ла) назву групи на «{title}»";
"lng_action_changed_title_channel" = "Channel name was changed to «{title}»";
"lng_action_created_chat" = "{from} створив(-ла) групу «{title}»";
"lng_action_created_channel" = "Канал створено";
"lng_action_group_migrate" = "Група була оновлена до супергрупи";
"lng_action_pinned_message" = "{from} pinned «{text}»";
"lng_action_pinned_media" = "{from} pinned {media}";
"lng_action_pinned_media_photo" = "фото";
"lng_action_pinned_media_video" = "відео";
"lng_action_pinned_media_audio" = "аудіо файл";
"lng_action_pinned_media_voice" = "голосове повідомлення";
"lng_action_pinned_media_video_message" = "відео-повідомлення";
"lng_action_pinned_media_file" = "файл";
"lng_action_pinned_media_gif" = "a GIF animation";
"lng_action_pinned_media_contact" = "контактна інформация";
"lng_action_pinned_media_location" = "a location mark";
"lng_action_pinned_media_sticker" = "a sticker";
"lng_action_pinned_media_emoji_sticker" = "a {emoji} sticker";
"lng_action_pinned_media_game" = "the game «{game}»";
"lng_action_game_score#one" = "{from} scored {count} in {game}";
"lng_action_game_score#other" = "{from} scored {count} in {game}";
"lng_action_game_you_scored#one" = "You scored {count} in {game}";
"lng_action_game_you_scored#other" = "You scored {count} in {game}";
"lng_action_game_score_no_game#one" = "{from} scored {count}";
"lng_action_game_score_no_game#other" = "{from} scored {count}";
"lng_action_game_you_scored_no_game#one" = "You scored {count}";
"lng_action_game_you_scored_no_game#other" = "You scored {count}";
"lng_action_payment_done" = "You have just successfully transferred {amount} to {user}";
"lng_action_payment_done_for" = "You have just successfully transferred {amount} to {user} for {invoice}";
"lng_action_took_screenshot" = "{from} took a screenshot!";
"lng_action_you_took_screenshot" = "You took a screenshot!";

"lng_ttl_photo_received" = "{from} sent you a self-destructing photo. Please view it on your mobile.";
"lng_ttl_photo_sent" = "You sent a self-destructing photo.";
"lng_ttl_photo_expired" = "Photo has expired";
"lng_ttl_video_received" = "{from} sent you a self-destructing video. Please view it on your mobile.";
"lng_ttl_video_sent" = "You sent a self-destructing video.";
"lng_ttl_video_expired" = "Video has expired";

"lng_profile_migrate_reached#one" = "{count} member limit reached";
"lng_profile_migrate_reached#other" = "{count} members limit reached";
"lng_profile_migrate_body" = "To get over this limit, you can upgrade your group to a supergroup.";
"lng_profile_migrate_learn_more" = "Learn more »";
"lng_profile_migrate_button" = "Оновити до супергрупи";
"lng_profile_convert_title" = "Конвертувати в супергрупу";
"lng_profile_convert_feature1" = "— New members see the full message history";
"lng_profile_convert_feature2" = "— Messages are deleted for all members";
"lng_profile_convert_feature3" = "— Admins can pin important messages";
"lng_profile_convert_feature4" = "— Creator can set a public link for the group";
"lng_profile_convert_warning" = "{bold_start}Note:{bold_end} This action can not be undone";
"lng_profile_convert_confirm" = "Перетворити";
"lng_profile_add_more_after_upgrade#one" = "You will be able to add up to {count} member after you upgrade your group to a supergroup.";
"lng_profile_add_more_after_upgrade#other" = "You will be able to add up to {count} members after you upgrade your group to a supergroup.";

"lng_channel_not_accessible" = "Вибачте, цей канал не доступний.";
"lng_group_not_accessible" = "Вибачте, ця група не доступна.";

"lng_channels_too_much_public_about" = "Sorry, you have reserved too many public usernames. You can revoke the link from one of your older groups or channels.";
"lng_channels_too_much_public_revoke_confirm_group" = "Are you sure you want to revoke the link {link}?\n\nThe group «{group}» will become private.";
"lng_channels_too_much_public_revoke_confirm_channel" = "Are you sure you want to revoke the link {link}?\n\nThe channel «{group}» will become private.";
"lng_channels_too_much_public_revoke" = "Відкликати";

"lng_group_invite_bad_link" = "Це посилання на запрошення не є дійсним, або строк його дії скінчився";
"lng_group_invite_join" = "Приєднатися";

"lng_group_invite_members#one" = "{count} member, among them:";
"lng_group_invite_members#other" = "{count} members, among them:";

"lng_group_invite_create" = "Створити ланку запрошення";
"lng_group_invite_about" = "Користувачі Telegram матимуть змогу приєднатись\nдо вашої групи, якщо перейдуть за цією ланкою.";
"lng_group_invite_create_new" = "Відкликати ланку запрошення";
"lng_group_invite_about_new" = "Your previous link will be deactivated and we'll generate a new invite link for you.";
"lng_group_invite_copied" = "Ланку запрошення скопійовано до буферу обміну.";
"lng_group_invite_no_room" = "Unable to join this group because there are too many members in it already.";

"lng_channel_public_link_copied" = "Ланку скопійовано до буферу обміну";

"lng_forwarded" = "Переслано від {user}";
"lng_forwarded_date" = "Original: {date}";
"lng_forwarded_channel" = "Переслано з {channel}";
"lng_forwarded_via" = "Переслано від {user} за допомогою {inline_bot}";
"lng_forwarded_channel_via" = "Переслано з {channel} за допомогою {inline_bot}";
"lng_forwarded_signed" = "{channel} ({user})";
"lng_in_reply_to" = "У відповідь на";
"lng_edited" = "відредаговане";
"lng_edited_date" = "Відредаговано: {date}";
"lng_cancel_edit_post_sure" = "Скасувати редагування?";
"lng_cancel_edit_post_yes" = "Так";
"lng_cancel_edit_post_no" = "Ні";

"lng_bot_share_location_unavailable" = "Sorry, the location sharing is currently unavailable in Telegram Desktop.";
"lng_bot_inline_geo_unavailable" = "Sorry, this bot requires location sharing.\nIt is not available in Telegram Desktop.";
"lng_bot_share_phone" = "Share Phone Number?";
"lng_bot_share_phone_confirm" = "Share";

"lng_attach_failed" = "Невдало";
"lng_attach_file" = "Файл";
"lng_attach_photo" = "Фото";

"lng_media_type" = "Тип файлу";
"lng_media_type_photos" = "Фотографії";
"lng_media_type_videos" = "Відео";
"lng_media_type_songs" = "Аудіо файли";
"lng_media_type_files" = "Файли";
"lng_media_type_audios" = "Голосові повідомлення";
"lng_media_type_links" = "Shared links";

"lng_media_open_with" = "Відкрити за допомогою";
"lng_media_download" = "Завантажити";
"lng_media_cancel" = "Відміна";
"lng_media_video" = "Відео";
"lng_media_audio" = "Голосові повідомлення";

"lng_media_auto_settings" = "Automatic media download settings";
"lng_media_auto_photo" = "Automatic photo download";
"lng_media_auto_audio" = "Automatic voice message download";
"lng_media_auto_gif" = "Automatic GIF download";
"lng_media_auto_private_chats" = "Особистий чат";
"lng_media_auto_groups" = "Групи та канали";
"lng_media_auto_play" = "Autoplay";

"lng_emoji_category0" = "Ті, що часто використовуються";
"lng_emoji_category1" = "Люди";
"lng_emoji_category2" = "Природа";
"lng_emoji_category3" = "Їжа та напої";
"lng_emoji_category4" = "Активність";
"lng_emoji_category5" = "Travel & Places";
"lng_emoji_category6" = "Об'єкти";
"lng_emoji_category7" = "Symbols & Flags";
"lng_emoji_hide_panel" = "Click here to hide the emoji sidebar";

"lng_recent_stickers" = "Frequently used";
"lng_faved_stickers" = "Favorite stickers";
"lng_faved_stickers_add" = "Add to Favorites";
"lng_faved_stickers_remove" = "Remove from Favorites";
"lng_group_stickers" = "Group stickers";
"lng_group_stickers_description" = "You can choose sticker set which will be available for every member while in the group chat.";
"lng_group_stickers_add" = "Choose sticker set";

"lng_switch_stickers" = "Наліпки";
"lng_switch_emoji" = "Емоційки";
"lng_switch_gifs" = "GIFs";
"lng_stickers_featured_add" = "Додати";
"lng_gifs_search" = "Search GIFs";
"lng_gifs_no_saved" = "You have no saved GIFs yet.";

"lng_inline_bot_no_results" = "Немає результатів.";
"lng_inline_bot_via" = "via {inline_bot}";

"lng_box_remove" = "Вилучити";

"lng_stickers_installed_tab" = "Stickers";
"lng_stickers_featured_tab" = "Trending";
"lng_stickers_archived_tab" = "Archived";
"lng_stickers_remove_pack" = "Вилучити «{sticker_pack}»?";
"lng_stickers_add_pack" = "Додати наліпки";
"lng_stickers_share_pack" = "Поширити наліпки";
"lng_stickers_not_found" = "Набору наліпок не знайдено.";
"lng_stickers_packs_archived" = "Some of your unused stickers have been archived to make room for the sets you've activated.";
"lng_stickers_copied" = "Ланку до набору наліпок скопійовано в буфер обміну.";
"lng_stickers_default_set" = "Видатні особистості";
"lng_stickers_you_have" = "Manage and reorder sticker packs";
"lng_stickers_return" = "Відмінити";
"lng_stickers_count#one" = "{count} sticker";
"lng_stickers_count#other" = "{count} stickers";
"lng_stickers_masks_pack" = "This is a pack of mask stickers. You can use them in the photo editor on our mobile apps.";
"lng_stickers_group_set" = "Group sticker set";
"lng_stickers_remove_group_set" = "Remove group sticker set?";
"lng_stickers_group_from_your" = "Choose from your stickers";

"lng_in_dlg_photo" = "Фото";
"lng_in_dlg_video" = "Відео";
"lng_in_dlg_audio_file" = "Аудіо файл";
"lng_in_dlg_contact" = "Контакт";
"lng_in_dlg_audio" = "Голосове повідомлення";
"lng_in_dlg_video_message" = "Відео-повідомлення";
"lng_in_dlg_file" = "Файл";
"lng_in_dlg_sticker" = "Стікер";
"lng_in_dlg_sticker_emoji" = "{emoji} Sticker";

"lng_ban_user" = "Заборонити користувача";
"lng_delete_all_from" = "Delete all from this user";
"lng_report_spam" = "Повідомити про спам";
"lng_report_spam_hide" = "Приховати";
"lng_report_spam_thanks" = "Thank you for your report!";
"lng_report_spam_sure" = "Ви дійсно хочете повідомити про спам від цього користувача?";
"lng_report_spam_sure_group" = "Are you sure you want to report spam in this group?";
"lng_report_spam_sure_channel" = "Are you sure you want to report spam in this channel?";
"lng_report_spam_ok" = "Повідомити";
"lng_cant_send_to_not_contact" = "Sorry, you can only send messages to\nmutual contacts at the moment.\n{more_info}";
"lng_cant_invite_not_contact" = "Sorry, you can only add mutual contacts\nto groups at the moment.\n{more_info}";
"lng_cant_more_info" = "Докладніше »";
"lng_cant_invite_banned" = "Sorry, only admin can add this user.";
"lng_cant_invite_privacy" = "Sorry, you cannot add this user to groups because of their privacy settings.";
"lng_cant_invite_privacy_channel" = "Sorry, you cannot add this user to channels because of their privacy settings.";
"lng_cant_delete_group#one" = "Sorry, it is currently not possible to manually delete communities that have more than {count} member. Please contact Telegram support if you would like to delete this group.";
"lng_cant_delete_group#other" = "Sorry, it is currently not possible to manually delete communities that have more than {count} members. Please contact Telegram support if you would like to delete this group.";
"lng_cant_delete_channel#one" = "Sorry, it is currently not possible to manually delete communities that have more than {count} member. Please contact Telegram support if you would like to delete this channel.";
"lng_cant_delete_channel#other" = "Sorry, it is currently not possible to manually delete communities that have more than {count} members. Please contact Telegram support if you would like to delete this channel.";
"lng_cant_do_this" = "Sorry, this action is unavailable.";

"lng_send_button" = "Надіслати";
"lng_message_ph" = "Написати повідомлення...";
"lng_broadcast_ph" = "Broadcast a message...";
"lng_broadcast_silent_ph" = "Silent broadcast...";
"lng_record_cancel" = "Відпустіть курсор поза цим полем, щоб скасувати";
"lng_will_be_notified" = "Members will be notified when you post";
"lng_wont_be_notified" = "Members will not be notified when you post";
"lng_willbe_history" = "Будь ласка оберіть балачку щоб почати розмову";
"lng_from_you" = "Ви";
"lng_from_draft" = "Чернетка";
"lng_bot_description" = "Що може цей робот?";
"lng_unblock_button" = "Розблокувати";
"lng_channel_join" = "Join Channel";
"lng_channel_mute" = "Вимкнути звук";
"lng_channel_unmute" = "Увімкнути";

"lng_dialogs_text_with_from" = "{from_part} {message}";
"lng_dialogs_text_from_wrapped" = "{from}:";
"lng_dialogs_text_media" = "{media_part} {caption}";
"lng_dialogs_text_media_wrapped" = "{media},";
"lng_dialogs_show_all_chats" = "Show all chats";
"lng_dialogs_hide_muted_chats" = "Hide muted chats";

"lng_open_this_link" = "Відкрити це посилання?";
"lng_open_link" = "Відкрити";
"lng_allow_bot_pass" = "Do you allow {bot_name} to pass your Telegram name and id to the web pages you open via this bot?";
"lng_allow_bot" = "Дозволити";

"lng_bot_start" = "Розпочати";
"lng_bot_choose_group" = "Оберіть групу";
"lng_bot_no_groups" = "У вас немає груп";
"lng_bot_groups_not_found" = "Груп не знайдено";
"lng_bot_sure_invite" = "Додати робота до «{group}»?";
"lng_bot_already_in_group" = "Цей робот вже є учасником цієї групи.";
"lng_bot_choose_chat" = "Оберіть чат";
"lng_bot_no_chats" = "You have no chats";
"lng_bot_chats_not_found" = "No chats found";
"lng_bot_sure_share_game" = "Share the game with {user}?";
"lng_bot_sure_share_game_group" = "Share the game with «{group}»?";

"lng_typing" = "друкує";
"lng_user_typing" = "{user} друкує";
"lng_users_typing" = "{user} та {second_user} друкують";
"lng_many_typing#one" = "{count} person is typing";
"lng_many_typing#other" = "{count} people are typing";
"lng_playing_game" = "playing a game";
"lng_user_playing_game" = "{user} is playing a game";
"lng_users_playing_game" = "{user} and {second_user} are playing a game";
"lng_many_playing_game#one" = "{count} person is playing a game";
"lng_many_playing_game#other" = "{count} people are playing a game";
"lng_send_action_record_video" = "recording a video";
"lng_user_action_record_video" = "{user} is recording a video";
"lng_send_action_upload_video" = "sending a video";
"lng_user_action_upload_video" = "{user} is sending a video";
"lng_send_action_record_audio" = "recording a voice message";
"lng_user_action_record_audio" = "{user} is recording a voice message";
"lng_send_action_upload_audio" = "sending a voice message";
"lng_user_action_upload_audio" = "{user} is sending a voice message";
"lng_send_action_record_round" = "recording a video message";
"lng_user_action_record_round" = "{user} is recording a video message";
"lng_send_action_upload_round" = "sending a video message";
"lng_user_action_upload_round" = "{user} is sending a video message";
"lng_send_action_upload_photo" = "sending a photo";
"lng_user_action_upload_photo" = "{user} is sending a photo";
"lng_send_action_upload_file" = "sending a file";
"lng_user_action_upload_file" = "{user} is sending a file";
"lng_send_action_geo_location" = "picking a location";
"lng_user_action_geo_location" = "{user} is picking a location";
"lng_send_action_choose_contact" = "choosing a contact";
"lng_user_action_choose_contact" = "{user} is choosing a contact";
"lng_unread_bar#one" = "{count} unread message";
"lng_unread_bar#other" = "{count} unread messages";

"lng_maps_point" = "Місцезнаходження ";
"lng_save_photo" = "Зберегти зображення";
"lng_save_video" = "Зберегти відео";
"lng_save_audio_file" = "Зберегти аудіо файл";
"lng_save_audio" = "Зберегти голосове повідомлення";
"lng_save_file" = "Зберегти файл";
"lng_save_downloaded" = "{ready} / {total} {mb}";
"lng_duration_and_size" = "{duration}, {size}";
"lng_duration_played" = "{played} / {duration}";
"lng_date_and_duration" = "{date}, {duration}";
"lng_choose_image" = "Обрати зображення";
"lng_choose_files" = "Обрати файли";
"lng_game_tag" = "Гра";

"lng_context_view_profile" = "View profile";
"lng_context_view_group" = "Перегляд інформації групи";
"lng_context_view_channel" = "Перегляд інформації каналу";
"lng_context_pin_to_top" = "Pin to top";
"lng_context_unpin_from_top" = "Unpin from top";

"lng_context_promote_admin" = "Promote to admin";
"lng_context_edit_permissions" = "Edit permissions";
"lng_context_restrict_user" = "Restrict user";
"lng_context_remove_from_group" = "Видалити з групи";

"lng_context_copy_link" = "Копіювати посилання";
"lng_context_copy_post_link" = "Copy Post Link";
"lng_context_copy_email" = "Копіювати адресу електронної пошти";
"lng_context_copy_hashtag" = "Copy Hashtag";
"lng_context_copy_mention" = "Копіювати ім'я користувача";
"lng_context_save_image" = "Зберегти зображення як...";
"lng_context_copy_image" = "Копіювати зображення";
"lng_context_cancel_download" = "Завантаження скасовано";
"lng_context_show_in_folder" = "Показати у теці";
"lng_context_show_in_finder" = "Показати у Finder";
"lng_context_save_video" = "Зберегти відео як...";
"lng_context_save_audio_file" = "Зберегти аудіо файл як...";
"lng_context_save_audio" = "Зберегти голосове повідомлення як...";
"lng_context_pack_info" = "Про наліпки";
"lng_context_pack_add" = "Додати наліпки";
"lng_context_save_file" = "Зберегти файл як...";
"lng_context_copy_text" = "Скопіювати текст";
"lng_context_open_gif" = "Open GIF";
"lng_context_save_gif" = "Save GIF";
"lng_context_to_msg" = "Перейти до повідомлення";
"lng_context_reply_msg" = "Відповісти";
"lng_context_edit_msg" = "Редагувати";
"lng_context_forward_msg" = "Переслати повідомлення";
"lng_context_delete_msg" = "Видалити повідомлення";
"lng_context_select_msg" = "Виділити повідомлення";
"lng_context_pin_msg" = "Pin Message";
"lng_context_unpin_msg" = "Unpin Message";
"lng_context_cancel_upload" = "Відмінити відправлення";
"lng_context_copy_selected" = "Копіювати виділене";
"lng_context_copy_selected_items" = "Copy Selected as Text";
"lng_context_forward_selected" = "Переслати виділене";
"lng_context_delete_selected" = "Видалити виділене";
"lng_context_clear_selection" = "Зняти виділення";
"lng_send_images_compress#one" = "Compress image";
"lng_send_images_compress#other" = "Compress images";
"lng_send_image_empty" = "Не вдалося відправити порожній файл: {name}";
"lng_send_image_too_large" = "Could not send a file, because it is larger than 1500 MB: {name}";
"lng_send_folder" = "Could not send «{name}» because it is a directory :(";
"lng_send_images_selected#one" = "{count} image selected";
"lng_send_images_selected#other" = "{count} images selected";
"lng_send_photos#one" = "Send {count} photo";
"lng_send_photos#other" = "Send {count} photos";
"lng_send_files_selected#one" = "{count} file selected";
"lng_send_files_selected#other" = "{count} files selected";
"lng_send_files#one" = "Send {count} file";
"lng_send_files#other" = "Send {count} files";

"lng_forward_choose" = "Choose recipient...";
"lng_forward_cant" = "Sorry, no way to forward here :(";
"lng_forward_share_contact" = "Поділитися з контактом {recipient}?";
"lng_forward_share_cant" = "Sorry, no way to share contact here :(";
"lng_forward_send_file_confirm" = "Надіслати «{name}» користувачу {recipient}?";
"lng_forward_send_files_confirm" = "Надіслати вибрані файли до {recipient}?";
"lng_forward_send_files_cant" = "Sorry, no way to send media here :(";
"lng_forward_send" = "Надіслати";
"lng_forward_messages#one" = "{count} forwarded message";
"lng_forward_messages#other" = "{count} forwarded messages";
"lng_forwarding_from#one" = "{user} and {count} other";
"lng_forwarding_from#other" = "{user} and {count} others";
"lng_forwarding_from_two" = "{user} і {second_user}";
"lng_inline_switch_choose" = "Choose conversation...";
"lng_inline_switch_cant" = "Sorry, no way to write here :(";

"lng_share_cant" = "Sorry, no way to share here :(";
"lng_reply_cant" = "Sorry, no way to reply to an old message in supergroup :(";
"lng_reply_cant_forward" = "Sorry, no way to reply to an old message in supergroup :( Do you wish to forward it and add your comment?";

"lng_share_title" = "Share to";
"lng_share_copy_link" = "Copy share link";
"lng_share_confirm" = "Надіслати";
"lng_share_wrong_user" = "This game was opened from a different user.";
"lng_share_game_link_copied" = "Game link copied to clipboard.";
"lng_share_done" = "Виконано!";

"lng_contact_phone" = "Номер телефону";
"lng_enter_contact_data" = "Новий контакт";
"lng_edit_group_title" = "Редагування імені групи";
"lng_edit_contact_title" = "Редагування імені контакту";
"lng_edit_channel_title" = "Змінити канал";
"lng_edit_sign_messages" = "Sign messages";
"lng_edit_group_who_invites" = "Who can add members";
"lng_edit_group_invites_everybody" = "All members";
"lng_edit_group_invites_only_admins" = "Only admins";
"lng_edit_group" = "Редагувати групу";
"lng_edit_self_title" = "Редагування вашого імені";
"lng_confirm_contact_data" = "Новий контакт";
"lng_add_contact" = "Створити";
"lng_add_contact_button" = "Новий контакт";
"lng_contacts_header" = "Контакти";
"lng_contact_not_joined" = "На жаль, {name} поки не приєднався до Telegram, але ви можете надіслати запрошення своєму другу.\n\nМи повідомимо Вам, коли будь-який з Ваших контактів приєднається до Telegram.";
"lng_try_other_contact" = "Спробуйте інші";
"lng_create_group_link" = "Посилання";
"lng_create_group_invite_link" = "Посилання для запрошення";
"lng_create_group_description" = "Опис (необов'язково)";

"lng_drag_images_here" = "Перетягніть зображення сюди";
"lng_drag_photos_here" = "Перетягніть фото сюди";
"lng_drag_files_here" = "Перетягніть файли сюди";

"lng_drag_to_send_quick" = ", для швидкого надсилання";
"lng_drag_to_send_no_compression" = ", для надсилання без стиснення";
"lng_drag_to_send_files" = ", щоб відправити їх у вигляді файлів";

"lng_selected_clear" = "Відмінити";
"lng_selected_delete" = "Видалити";
"lng_selected_forward" = "Переслати";
"lng_selected_cancel_sure_this" = "Відмінити надсилання?";
"lng_selected_upload_stop" = "Стоп";
"lng_selected_delete_sure_this" = "Видалити надсилання?";
"lng_selected_delete_sure#one" = "Do you want to delete {count} message?";
"lng_selected_delete_sure#other" = "Do you want to delete {count} messages?";
"lng_delete_photo_sure" = "Do you want to delete this photo?";
"lng_delete_for_everyone_hint#one" = "This will delete it for everyone in this chat.";
"lng_delete_for_everyone_hint#other" = "This will delete them for everyone in this chat.";
"lng_delete_for_me_chat_hint#one" = "This will delete it just for you, not for other participants of the chat.";
"lng_delete_for_me_chat_hint#other" = "This will delete them just for you, not for other participants of the chat.";
"lng_delete_for_me_hint#one" = "This will delete it just for you.";
"lng_delete_for_me_hint#other" = "This will delete them just for you.";
"lng_delete_for_everyone_check" = "Видалити для всіх";
"lng_delete_for_other_check" = "Видалити для {user}";
"lng_box_delete" = "Видалити";
"lng_box_leave" = "Покинути";

"lng_about_version" = "Версія {version}";
"lng_about_text_1" = "Official free messaging app based on [a href=\"https://core.telegram.org/api\"]Telegram API[/a]\nfor speed and security.";
"lng_about_text_2" = "This software is licensed under [a href=\"https://github.com/telegramdesktop/tdesktop/blob/master/LICENSE\"]GNU GPL[/a] version 3.\nSource code is available on [a href=\"https://github.com/telegramdesktop/tdesktop\"]GitHub[/a].";
"lng_about_text_3" = "Visit {faq_open}Telegram FAQ{faq_close} for more info.";
"lng_about_done" = "Закрити";

"lng_search_no_results" = "No messages found";
"lng_search_found_results#one" = "Found {count} message";
"lng_search_found_results#other" = "Found {count} messages";
"lng_search_global_results" = "Результати глобального пошуку";
"lng_search_messages_from" = "Show messages from";

"lng_media_save_progress" = "{ready} / {total} {mb}";
"lng_mediaview_save_as" = "Зберегти як...";
"lng_mediaview_copy" = "Копіювати";
"lng_mediaview_forward" = "Переслати";
"lng_mediaview_delete" = "Видалити";
"lng_mediaview_photos_all" = "Переглянути всі світлини";
"lng_mediaview_files_all" = "Переглянути всі файли";
"lng_mediaview_single_photo" = "Фото";
"lng_mediaview_group_photo" = "Фото групи";
"lng_mediaview_channel_photo" = "Channel Photo";
"lng_mediaview_profile_photo" = "Фото профілю";
"lng_mediaview_file_n_of_count" = "{file} {n} з {count}";
"lng_mediaview_n_of_count" = "Фото {n} з {count}";
"lng_mediaview_doc_image" = "Документ";
"lng_mediaview_today" = "сьогодні в {time}";
"lng_mediaview_yesterday" = "вчора в {time}";
"lng_mediaview_date_time" = "{date} в {time}";

"lng_mediaview_saved" = "Зображення було збережене в теці [c]Downloads[/c]";

"lng_theme_preview_title" = "Попередній перегляд теми";
"lng_theme_preview_generating" = "Generating color theme preview...";
"lng_theme_preview_invalid" = "Invalid data in this theme file.";
"lng_theme_preview_apply" = "Apply this theme";

"lng_new_authorization" = "{name},\nМи виявили вхід у ваш обліковий запис з нового пристрою {day}, {date} о {time}\n\nПристрій: {device}\nМісцезнаходження: {location}\n\nЯкщо це були не ви, можете перейти в Налаштування – Показати всі сеанси та завершити цей сеан.\n\nЯкщо ви вважаєте, що хтось увійшов у вашу обліковку проти вашої волі, ви можете увімкнути двофакторну перевірку в налаштуваннях.\n\nКрасно дякуємо,\nКоманда Telegram";

"lng_new_version_wrap" = "Telegram Desktop був оновлений до версії {version}\n\n{changes}\n\nПовна історія змін доступна тут: {link}";
"lng_new_version_minor" = "— Виправлення помилок та інші поліпшення";

"lng_menu_insert_unicode" = "Вставте керівний символ Unicode";

"lng_full_name" = "{first_name} {last_name}";

"lng_confirm_phone_link_invalid" = "Посилання не є дійсним, або строк його дії скінчився";
"lng_confirm_phone_title" = "Cancel account reset";
"lng_confirm_phone_about" = "Somebody with access to your phone number {phone} has requested to delete your Telegram account and reset your 2-Step Verification password.\n\nIf this wasn't you, please enter the code we've just sent you via SMS to your number.";
"lng_confirm_phone_success" = "Success!\n\nThe deletion process was cancelled for your account {phone}. You may close this window now.";
"lng_confirm_phone_send" = "Надіслати";
"lng_confirm_phone_enter_code" = "Будь ласка, введіть код.";

"lng_theme_editor_no_keys" = "No keys in the palette yet";
"lng_theme_editor_cant_change_theme" = "You can not apply new themes while you're editing the color palette. Please close the theme editor first.";
"lng_theme_editor_new_keys" = "Not in the palette yet";
"lng_theme_editor_background_image" = "Background image";
"lng_theme_editor_saved_to_jpg" = "Saved to JPEG, {size}";
"lng_theme_editor_read_from_jpg" = "JPEG image, {size}";
"lng_theme_editor_read_from_png" = "PNG image, {size}";
"lng_theme_editor_export" = "Експорт";
"lng_theme_editor_choose_image" = "Choose background image";
"lng_theme_editor_save_palette" = "Save palette file";
"lng_theme_editor_choose_name" = "Зберегти файл теми";
"lng_theme_editor_error" = "The editor encountered an error :( See 'log.txt' for details.";
"lng_theme_editor_done" = "Theme exported successfully!";
"lng_theme_editor_title" = "Edit color palette";
"lng_theme_editor_export_button" = "Експортувати тему";

"lng_payments_not_supported" = "Sorry, Telegram Desktop doesn't support payments yet. Please use one of our mobile apps to do this.";
"lng_payments_receipt_label" = "Receipt";
"lng_payments_receipt_label_test" = "Test receipt";
"lng_payments_invoice_label" = "Рахунок";
"lng_payments_invoice_label_test" = "Тестовий рахунок";
"lng_payments_receipt_button" = "Receipt";

"lng_call_status_incoming" = "is calling you...";
"lng_call_status_connecting" = "з'єднання...";
"lng_call_status_exchanging" = "exchanging encryption keys...";
"lng_call_status_waiting" = "очікування...";
"lng_call_status_requesting" = "requesting...";
"lng_call_status_hanging" = "hanging up...";
"lng_call_status_ended" = "виклик завершений";
"lng_call_status_failed" = "помилка з'єднання";
"lng_call_status_ringing" = "виклик...";
"lng_call_status_busy" = "лінія зайнята";
"lng_call_fingerprint_tooltip" = "If emoji on {user}'s screen are the same, this call is 100% secure";

"lng_call_error_not_available" = "Sorry, {user} doesn't accept calls.";
"lng_call_error_incompatible" = "{user}'s app is using an incompatible protocol. They need to update their app before you can call them.";
"lng_call_error_outdated" = "{user}'s app does not support calls. They need to update their app before you can call them.";
"lng_call_error_audio_io" = "There seems to be a problem with audio playback on your computer. Please make sure that your computer's speakers and microphone are working and try again.";

"lng_call_bar_hangup" = "Завершити виклик";

"lng_call_box_title" = "Викликів";
"lng_call_box_about" = "You didn't make any calls yet.";
"lng_call_box_status_today" = "{time}";
"lng_call_box_status_yesterday" = "Yesterday at {time}";
"lng_call_box_status_date" = "{date} at {time}";
"lng_call_box_status_group" = "({count}) {status}";

"lng_call_outgoing" = "Вихідний дзвінок";
"lng_call_incoming" = "Вхідний дзвінок";
"lng_call_missed" = "Пропущений виклик";
"lng_call_cancelled" = "Скасований виклик";
"lng_call_declined" = "Відхилений виклик";
"lng_call_duration_info" = "{time}, {duration}";
"lng_call_type_and_duration" = "{type} ({duration})";

"lng_call_rate_label" = "Please rate the quality of your call";
"lng_call_rate_comment" = "Comment (optional)";

"lng_player_message_today" = "Today at {time}";
"lng_player_message_yesterday" = "Yesterday at {time}";
"lng_player_message_date" = "{date} at {time}";

"lng_rights_edit_admin" = "Edit administrator";
"lng_rights_edit_admin_header" = "What can this admin do?";
"lng_rights_about_add_admins_yes" = "This admin will be able to add new admins with the same (or more limited) permissions.";
"lng_rights_about_add_admins_no" = "This admin will not be able to add new admins.";
"lng_rights_about_admin_cant_edit" = "You cannot edit rights of this admin.";
"lng_rights_user_restrictions" = "User restrictions";
"lng_rights_user_restrictions_header" = "What can this user do?";

"lng_rights_channel_info" = "Change channel info";
"lng_rights_channel_post" = "Post messages";
"lng_rights_channel_edit" = "Edit messages of others";
"lng_rights_channel_delete" = "Delete messages of others";
"lng_rights_group_info" = "Change group info";
"lng_rights_group_ban" = "Ban users";
"lng_rights_group_invite_link" = "Invite users via link";
"lng_rights_group_invite" = "Add users";
"lng_rights_group_pin" = "Pin messages";
"lng_rights_group_delete" = "Delete messages";
"lng_rights_add_admins" = "Add new admins";
"lng_rights_chat_read" = "Read messages";
"lng_rights_chat_send_text" = "Send messages";
"lng_rights_chat_send_media" = "Send media";
"lng_rights_chat_send_stickers" = "Send stickers & GIFs";
"lng_rights_chat_send_links" = "Embed links";
"lng_rights_chat_banned_until_header" = "Restricted until";
"lng_rights_chat_banned_forever" = "Forever";
"lng_rights_chat_banned_day#one" = "For {count} day";
"lng_rights_chat_banned_day#other" = "For {count} days";
"lng_rights_chat_banned_week#one" = "For {count} week";
"lng_rights_chat_banned_week#other" = "For {count} weeks";
"lng_rights_chat_banned_custom" = "Custom";
"lng_rights_chat_banned_custom_date" = "Until {date}";

"lng_restricted_send_message" = "The admins of this group restricted you from writing here.";
"lng_restricted_send_media" = "The admins of this group restricted you from posting media content here.";
"lng_restricted_send_stickers" = "The admins of this group restricted you from posting stickers here.";
"lng_restricted_send_gifs" = "The admins of this group restricted you from posting GIFs here.";
"lng_restricted_send_inline" = "The admins of this group restricted you from posting inline content here.";

"lng_restricted_list_title" = "Restricted users";
"lng_banned_list_title" = "Banned users";

"lng_admin_log_title_all" = "All actions";
"lng_admin_log_title_selected" = "Selected actions";
"lng_admin_log_filter" = "Filter";
"lng_admin_log_filter_title" = "Filter";
"lng_admin_log_filter_all_actions" = "All actions";
"lng_admin_log_filter_restrictions" = "New restrictions";
"lng_admin_log_filter_admins_new" = "New admins";
"lng_admin_log_filter_members_new" = "New members";
"lng_admin_log_filter_info_group" = "Group info";
"lng_admin_log_filter_info_channel" = "Channel info";
"lng_admin_log_filter_messages_deleted" = "Deleted messages";
"lng_admin_log_filter_messages_edited" = "Edited messages";
"lng_admin_log_filter_messages_pinned" = "Pinned messages";
"lng_admin_log_filter_members_removed" = "Leaving members";
"lng_admin_log_filter_all_admins" = "All users and admins";
"lng_admin_log_about" = "What is this?";
"lng_admin_log_about_text" = "This is a list of all service actions taken by the group's members and admins in the last 48 hours.";
"lng_admin_log_no_results_title" = "No actions found";
"lng_admin_log_no_results_text" = "No recent actions that match your query have been found.";
"lng_admin_log_no_results_search_text" = "No recent actions that contain '{query}' have been found.";
"lng_admin_log_no_events_title" = "No actions yet";
"lng_admin_log_no_events_text" = "There were no service actions\ntaken by the group's members\nand admins in the last 48 hours.";

"lng_admin_log_empty_text" = "Empty";
"lng_admin_log_changed_title_group" = "{from} changed group name to «{title}»";
"lng_admin_log_changed_title_channel" = "{from} changed channel name to «{title}»";
"lng_admin_log_changed_description_group" = "{from} edited group description:";
"lng_admin_log_removed_description_group" = "{from} removed group description";
"lng_admin_log_changed_description_channel" = "{from} edited channel description:";
"lng_admin_log_removed_description_channel" = "{from} removed channel description";
"lng_admin_log_previous_description" = "Previous description";
"lng_admin_log_changed_link_group" = "{from} changed group link:";
"lng_admin_log_removed_link_group" = "{from} removed group link";
"lng_admin_log_changed_link_channel" = "{from} changed channel link:";
"lng_admin_log_removed_link_channel" = "{from} removed channel link";
"lng_admin_log_previous_link" = "Previous link";
"lng_admin_log_changed_photo_group" = "{from} changed group photo";
"lng_admin_log_changed_photo_channel" = "{from} changed channel photo";
"lng_admin_log_removed_photo_group" = "{from} removed group photo";
"lng_admin_log_removed_photo_channel" = "{from} removed channel photo";
"lng_admin_log_invites_enabled" = "{from} enabled group invites";
"lng_admin_log_invites_disabled" = "{from} disabled group invites";
"lng_admin_log_signatures_enabled" = "{from} enabled signatures";
"lng_admin_log_signatures_disabled" = "{from} disabled signatures";
"lng_admin_log_pinned_message" = "{from} pinned message:";
"lng_admin_log_unpinned_message" = "{from} unpinned message";
"lng_admin_log_edited_caption" = "{from} edited caption:";
"lng_admin_log_removed_caption" = "{from} removed caption";
"lng_admin_log_previous_caption" = "Original caption";
"lng_admin_log_edited_message" = "{from} edited message:";
"lng_admin_log_previous_message" = "Original message";
"lng_admin_log_deleted_message" = "{from} deleted message:";
"lng_admin_log_participant_joined" = "{from} joined the group";
"lng_admin_log_participant_joined_channel" = "{from} joined the channel";
"lng_admin_log_participant_left" = "{from} left the group";
"lng_admin_log_participant_left_channel" = "{from} left the channel";
"lng_admin_log_invited" = "invited {user}";
"lng_admin_log_banned" = "banned {user}";
"lng_admin_log_restricted" = "changed restrictions for {user} {until}";
"lng_admin_log_promoted" = "changed privileges for {user}";
"lng_admin_log_changed_stickers_group" = "{from} changed group {sticker_set}";
"lng_admin_log_changed_stickers_set" = "sticker set";
"lng_admin_log_removed_stickers_group" = "{from} removed group sticker set";
"lng_admin_log_user_with_username" = "{name} ({mention})";
"lng_admin_log_restricted_forever" = "indefinitely";
"lng_admin_log_restricted_until" = "until {date}";
"lng_admin_log_banned_view_messages" = "Read messages";
"lng_admin_log_banned_send_messages" = "Send messages";
"lng_admin_log_banned_send_media" = "Send media";
"lng_admin_log_banned_send_stickers" = "Send stickers & GIFs";
"lng_admin_log_banned_embed_links" = "Embed links";
"lng_admin_log_admin_change_info" = "Change info";
"lng_admin_log_admin_post_messages" = "Post messages";
"lng_admin_log_admin_edit_messages" = "Edit messages";
"lng_admin_log_admin_delete_messages" = "Delete messages";
"lng_admin_log_admin_ban_users" = "Ban users";
"lng_admin_log_admin_invite_users" = "Add users";
"lng_admin_log_admin_invite_link" = "Invite users via link";
"lng_admin_log_admin_pin_messages" = "Pin messages";
"lng_admin_log_admin_add_admins" = "Add new admins";

// Wnd specific

"lng_wnd_choose_program_menu" = "Вибрати програму за замовчуванням...";

"lng_wnd_menu_undo" = "Повернути";
"lng_wnd_menu_redo" = "Повторити";

// Linux specific

"lng_linux_menu_undo" = "Повернути";
"lng_linux_menu_redo" = "Повторити";

// Mac specific

"lng_mac_choose_program_menu" = "Інше...";

"lng_mac_choose_app" = "Виберіть програму";
"lng_mac_choose_text" = "Оберіть програму для відкриття документу\"{file}\".";
"lng_mac_enable_filter" = "Увімкнути:";
"lng_mac_recommended_apps" = "Рекомендовані програми";
"lng_mac_all_apps" = "Усі програми";
"lng_mac_always_open_with" = "Завжди відкривати за допомогою";
"lng_mac_this_app_can_open" = "Ця програма може відкрити \"{file}\".";
"lng_mac_not_known_app" = "Невідомо, чи зможе відкрити ця програма \"{file}\".";

"lng_mac_menu_services" = "Сервіси";
"lng_mac_menu_hide_telegram" = "Сховати {telegram}";
"lng_mac_menu_hide_others" = "Сховати інші";
"lng_mac_menu_show_all" = "Показати все";
"lng_mac_menu_preferences" = "Налаштування...";
"lng_mac_menu_quit_telegram" = "Вийти з {telegram}";
"lng_mac_menu_about_telegram" = "Про {telegram}";
"lng_mac_menu_file" = "Файл";
"lng_mac_menu_logout" = "Вийти";
"lng_mac_menu_edit" = "Правка";
"lng_mac_menu_undo" = "Відмінити";
"lng_mac_menu_redo" = "Повернути";
"lng_mac_menu_cut" = "Вирізати";
"lng_mac_menu_copy" = "Копіювати";
"lng_mac_menu_paste" = "Вставити";
"lng_mac_menu_delete" = "Видалити";
"lng_mac_menu_select_all" = "Виділити все";
"lng_mac_menu_window" = "Вікно";
"lng_mac_menu_contacts" = "Контакти";
"lng_mac_menu_add_contact" = "Додати контакт";
"lng_mac_menu_new_group" = "Нова група";
"lng_mac_menu_new_channel" = "Новий канал";
"lng_mac_menu_show" = "Показати Telegram";

// Keys finished
